// ============================================================================
// 
// メインページの ViewModel
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using CommunityToolkit.Mvvm.ComponentModel;

using WinRT;

namespace TestAotTips.ViewModels.MainWindows;

[GeneratedBindableCustomProperty]
public partial class MainPageViewModel : ObservableRecipient
{
	// ====================================================================
	// コンストラクター
	// ====================================================================

	/// <summary>
	/// メインコンストラクター
	/// </summary>
	public MainPageViewModel()
	{
	}

	// ====================================================================
	// public プロパティー
	// ====================================================================

	// --------------------------------------------------------------------
	// View 通信用のプロパティー
	// --------------------------------------------------------------------

	/// <summary>
	/// テスト用
	/// </summary>
	private Int32 _testInt32 = 99;
	public Int32 TestInt32
	{
		get => _testInt32;
		set => SetProperty(ref _testInt32, value);
	}
}
