// ============================================================================
// 
// メインページの ViewModel
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

using CommunityToolkit.Mvvm.ComponentModel;

using TestAotTips.Models;

using WinRT;

namespace TestAotTips.ViewModels.MainWindows;

[GeneratedBindableCustomProperty]
internal partial class MainPageViewModel : ObservableRecipient
{
	// ====================================================================
	// コンストラクター
	// ====================================================================

	/// <summary>
	/// メインコンストラクター
	/// </summary>
	public MainPageViewModel()
	{
	}

	// ====================================================================
	// public プロパティー
	// ====================================================================

	// --------------------------------------------------------------------
	// View 通信用のプロパティー
	// --------------------------------------------------------------------

	/// <summary>
	/// テスト用数値
	/// </summary>
	private Int32 _testInt32 = 99;
	public Int32 TestInt32
	{
		get => _testInt32;
		set => SetProperty(ref _testInt32, value);
	}

	/// <summary>
	/// テスト用リスト
	/// </summary>
	public List<Person> TestList
	{
		get;
	} =
	[
		new ("太郎", 20),
		new ("次郎", 15),
		new ("三郎", 12),
	];
}
